scripts/load-test.yml
# Artillery Load Test Configuration for Live Score API
# https://www.artillery.io/docs

config:
  target: 'http://localhost:8000'
  phases:
    # Phase 1: Warm up - gradual ramp up
    - duration: 60
      arrivalRate: 5
      name: 'Warm up'
    
    # Phase 2: Normal load
    - duration: 120
      arrivalRate: 10
      name: 'Normal load'
    
    # Phase 3: Peak load
    - duration: 60
      arrivalRate: 50
      name: 'Peak load'
    
    # Phase 4: Cool down
    - duration: 60
      arrivalRate: 5
      name: 'Cool down'
  
  # Default headers
  defaults:
    headers:
      Content-Type: 'application/json'
  
  # Plugins
  plugins:
    expect: {}
    metrics-by-endpoint: {}

scenarios:
  # Scenario 1: Browse matches (most common)
  - name: 'Browse matches'
    weight: 50
    flow:
      - get:
          url: '/api/matches'
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: '/api/matches/{{ $randomInt(1, 3) }}'
          expect:
            - statusCode: 200
      - think: 3

  # Scenario 2: View match commentary
  - name: 'View commentary'
    weight: 30
    flow:
      - get:
          url: '/api/matches/{{ $randomInt(1, 3) }}/commentary'
          expect:
            - statusCode: 200
      - think: 5

  # Scenario 3: Health checks (monitoring)
  - name: 'Health check'
    weight: 20
    flow:
      - get:
          url: '/health'
          expect:
            - statusCode: 200
      - think: 10